Tekla Open API Reference for Tekla Structures 2025
BoltGroup.SecondPosition Property
 The second position point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point SecondPosition { get; set; }
Public Property SecondPosition As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace